In [18]:
import pymysql
import pyodbc
import sqlalchemy as sa
import urllib

from sqlalchemy.engine.url import URL

conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd= 'ka240817',db='teste_sql')

df=a.read_sql_query("SELECT * FROM tb_alimentacao ",conn)

print(df)

     id_residuo  id_usina data_alimentacao  volume_residuo
0             1         1       2021-10-13            95.0
1             1         2       2021-06-26            10.0
2             1         2       2021-10-22            36.0
3             1         3       2021-02-28            13.0
4             1         3       2021-04-26            10.0
..          ...       ...              ...             ...
261           9         4       2022-01-08            41.0
262           9         5       2021-04-14            67.0
263           9         5       2022-01-04            94.0
264           9         6       2021-08-29            17.0
265           9         7       2021-07-01            99.0

[266 rows x 4 columns]

/Users/batistajunior/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [22]:
# Carregando os Dados em um DataFrame
##--(foi registrado na tabela 266 linhas e 4 colunas na "tabela tb_alimentação")--

In [20]:
df.head()

   id_residuo  id_usina data_alimentacao  volume_residuo
0           1         1       2021-10-13            95.0
1           1         2       2021-06-26            10.0
2           1         2       2021-10-22            36.0
3           1         3       2021-02-28            13.0
4           1         3       2021-04-26            10.0